wyniki_zwykle/fio_results_xfs_hdd/block_size_default_compression_none/lab-sec-11/fio_webserver_test_output.txt
webserver_test: (g=0): rw=randread, bs=(R) 4096B-8192B, (W) 4096B-8192B, (T) 4096B-8192B, ioengine=libaio, iodepth=32
...
fio-3.36
Starting 16 processes
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
[...]

webserver_test: (groupid=0, jobs=16): err= 0: pid=49817: Fri May  2 23:10:37 2025
  read: IOPS=312, BW=1373KiB/s (1406kB/s)(161MiB/120305msec)
    slat (usec): min=14, max=212497, avg=51058.28, stdev=10940.76
    clat (msec): min=15, max=3229, avg=1577.01, stdev=207.41
     lat (msec): min=15, max=3284, avg=1628.07, stdev=209.27
    clat percentiles (msec):
     |  1.00th=[  995],  5.00th=[ 1318], 10.00th=[ 1385], 20.00th=[ 1452],
     | 30.00th=[ 1502], 40.00th=[ 1536], 50.00th=[ 1569], 60.00th=[ 1603],
     | 70.00th=[ 1636], 80.00th=[ 1703], 90.00th=[ 1821], 95.00th=[ 1921],
     | 99.00th=[ 2165], 99.50th=[ 2265], 99.90th=[ 2534], 99.95th=[ 2635],
     | 99.99th=[ 2869]
   bw (  KiB/s): min=  720, max= 1992, per=99.98%, avg=1373.13, stdev=11.32, samples=3798
   iops        : min=  174, max=  402, avg=312.47, stdev= 1.91, samples=3798
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.07%, 500=0.23%
  lat (msec)   : 750=0.24%, 1000=0.47%, 2000=96.08%, >=2000=2.91%
  cpu          : usr=0.05%, sys=0.15%, ctx=37632, majf=0, minf=1193
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.7%, 32=98.7%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=37597,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1373KiB/s (1406kB/s), 1373KiB/s-1373KiB/s (1406kB/s-1406kB/s), io=161MiB (169MB), run=120305-120305msec

Disk stats (read/write):
  sda: ios=37588/66, sectors=330360/744, merge=0/18, ticks=7677625/7306, in_queue=7686667, util=96.52%